#Пример№1 123-> 6 (1+2+3)

# a=1
# b=2
# c=3

# a =  int (input('Введите первое число:'))
# b =  int(input('Введите второе число:'))
# c =  int(input('Введите второе число:'))
# print( a + b + c , f"({a}+{b}+{c})" ) 



#Пример №2 100 -> 1 (1+0+0)

# a=1
# b=0
# c=0


a= int(input('Введите первое число'))
b= int(input('Введите второе число:'))
c= int(input('Введите третье число'))
print(a+b+c, f"({a}+{b}+{c})")




#Задача № 4

