# n = int (input('Введите расстояние в день : '))
# m = int(input('Введите расстояния : '))

# print((m+n-1)//n, 'Пройденое') 

# i = int(input('Ведите год :'))
# # если кратен 4 , но не кратен 100, а также если он кратен 400
# if i % 4 == 0 and i % 100 > 0 or i % 400 == 0:
#     print('высокосный год')
# else :
#     print('год высокостный')
a=5
b=5.89
c='privet'
print(f"{a} - {b} - {c}")
print("{}-{}-{}".format(a,b,c)   )
print("Введите первое число :")
a =int (input())
b= int (input('Введите второе число:'))
print(a, '+', b, '=', a ,b) 